In [63]:
import pandas as pd
import openpyxl as xl

In [64]:
# Tes DATA
data = pd.read_csv('./data.csv', sep=';')
data.head()

   Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Unnamed: 4
0  Andi              80         70         90         NaN
1  Budi              90         80         70         NaN
2  Caca              70         90         80         NaN
3  Dedi              60         80         90         NaN
4  Euis              50         70         80         NaN

In [65]:
# Soal No. 2
dataList = data.iloc[:, :-1]
dataList['Nilai Akhir'] = dataList['Nilai Formatif'] * 0.3 + dataList['Nilai UTS'] * 0.3 + dataList['Nilai UAS'] * 0.4
dataList

       Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir
0      Andi              80         70         90         81.0
1      Budi              90         80         70         79.0
2      Caca              70         90         80         80.0
3      Dedi              60         80         90         78.0
4      Euis              50         70         80         68.0
5      Fafa              40         60         70         58.0
6      Gigi              30         50         60         48.0
7      Haha              20         40         50         38.0
8      Iwan              10         30         40         28.0
9      Joko               0         20         30         18.0
10    Riyan              98         70         60         74.4
11    Alfin              80         70         90         81.0
12    Rizky              90         80         70         79.0
13    Rizal              70         90         80         80.0
14  Maulana              60         80         90         78.0

In [66]:
# Soal No. 1
# 5 peringkat terbawah
peringkatBawah = dataList.sort_values(by=['Nilai Akhir']).head()
peringkatBawah

   Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir
9  Joko               0         20         30         18.0
8  Iwan              10         30         40         28.0
7  Haha              20         40         50         38.0
6  Gigi              30         50         60         48.0
5  Fafa              40         60         70         58.0

In [67]:
# Soal No. 1
# 5 peringkat teratas
peringkatAtas = dataList.sort_values(by=['Nilai Akhir'], ascending=False).head()
peringkatAtas

     Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir
0    Andi              80         70         90         81.0
11  Alfin              80         70         90         81.0
2    Caca              70         90         80         80.0
13  Rizal              70         90         80         80.0
1    Budi              90         80         70         79.0

In [68]:
# Soal No. 2
# Tentukan nilai rata-rata dari masing-masing siswa!
dataList['Rata Rata'] = ((dataList['Nilai Formatif'] + dataList['Nilai UTS'] + dataList['Nilai UAS']) / 3).round(1)
dataList

       Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir  Rata Rata
0      Andi              80         70         90         81.0       80.0
1      Budi              90         80         70         79.0       80.0
2      Caca              70         90         80         80.0       80.0
3      Dedi              60         80         90         78.0       76.7
4      Euis              50         70         80         68.0       66.7
5      Fafa              40         60         70         58.0       56.7
6      Gigi              30         50         60         48.0       46.7
7      Haha              20         40         50         38.0       36.7
8      Iwan              10         30         40         28.0       26.7
9      Joko               0         20         30         18.0       16.7
10    Riyan              98         70         60         74.4       76.0
11    Alfin              80         70         90         81.0       80.0
12    Rizky              90         80         70         79.0       80.0
13    Rizal              70         90         80         80.0       80.0
14  Maulana              60         80         90         78.0       76.7

In [69]:
# Soal No. 3
rataRata = dataList[['Nilai Formatif', 'Nilai UTS', 'Nilai UAS']].mean()
rataRata

Nilai Formatif    56.533333
Nilai UTS         65.333333
Nilai UAS         70.000000
dtype: float64

In [75]:
# Soal No. 4
# Nilai akhir tertinggi
nilaiAkhirTertinggi = dataList[dataList['Rank'] == 1]
nilaiAkhirTertinggi

     Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir  Rata Rata  Rank
0    Andi              80         70         90         81.0       80.0     1
11  Alfin              80         70         90         81.0       80.0     1

In [ ]:
# Soal No. 4
# Nilai akhir terendah
nilaiAkhirTerendah = dataList.sort_values(by=['Nilai Akhir']).head(1)
nilaiAkhirTerendah

   Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir  Rank  Rata Rata
9  Joko               0         20         30         18.0    15       16.7

In [82]:
# Soal No. 5
# Tampilkan siswa yang memiliki nilai akhir yang sama.

for nilai_akhir, group in dataList.groupby('Nilai Akhir'):
    if len(group) > 1:
        print(f"Nilai Akhir: {nilai_akhir}")
        print(group[['Nama', 'Nilai Akhir']])

Nilai Akhir: 78.0
       Nama  Nilai Akhir
3      Dedi         78.0
14  Maulana         78.0
Nilai Akhir: 79.0
     Nama  Nilai Akhir
1    Budi         79.0
12  Rizky         79.0
Nilai Akhir: 80.0
     Nama  Nilai Akhir
2    Caca         80.0
13  Rizal         80.0
Nilai Akhir: 81.0
     Nama  Nilai Akhir
0    Andi         81.0
11  Alfin         81.0

In [ ]:
# Soal No. 6
# Tampilkan semua siswa yang memiliki nilai akhir > 80
nilaiAkhirTinggi = dataList[dataList['Nilai Akhir'] > 80]
nilaiAkhirTinggi

     Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir  Rank  Rata Rata
0    Andi              80         70         90         81.0     1       80.0
11  Alfin              80         70         90         81.0     1       80.0

In [74]:
# Soal No. 7
# Berikan peringkat pada masing-masing siswa berdasarkan nilai akhirnya dan tampilkan dalam bentuk dataframe!

dataList['Rank'] = dataList['Nilai Akhir'].rank(ascending=False).astype(int)
dataList

,Nama,Nilai Formatif,Nilai UTS,Nilai UAS,Nilai Akhir,Rata Rata,Rank
0,Andi,80,70,90,81.0,80.0,1
1,Budi,90,80,70,79.0,80.0,5
2,Caca,70,90,80,80.0,80.0,3
3,Dedi,60,80,90,78.0,76.7,7
4,Euis,50,70,80,68.0,66.7,10
5,Fafa,40,60,70,58.0,56.7,11
6,Gigi,30,50,60,48.0,46.7,12
7,Haha,20,40,50,38.0,36.7,13
8,Iwan,10,30,40,28.0,26.7,14
9,Joko,0,20,30,18.0,16.7,15
10,Riyan,98,70,60,74.4,76.0,9
11,Alfin,80,70,90,81.0,80.0,1
12,Rizky,90,80,70,79.0,80.0,5
13,Rizal,70,90,80,80.0,80.0,3
14,Maulana,60,80,90,78.0,76.7,7

In [ ]:
#Soal No. 8
# Export hasil data.csv kedalam bentuk excel!
dataList.to_excel('./data.xlsx', index=False)